import { useParams, Link } from 'react-router-dom';
import data from '../utils/aboutData'
import { useMemo } from 'react';
import BtnBeigie from '../UI/BtnBeigie';
import BlogSection from '../components/homePage/BlogSection';

function Blog() {
  const params = useParams();
  const id = +params.blogId;

  const blog = useMemo(() => data?.find((f) => f.id === id), [id, data]);

  return (
    <>
      <div className='container max-w-[954px]'>
        <div className='flex items-center gap-2 body-20'>
          <div className="text-beigie-100 pr-5">{blog.data}</div>
          <div className='flex items-center gap-2 border-l border-stroke pl-5'>
            <svg width="22" height="19" viewBox="0 0 22 19" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M2.275 12.796C1.425 11.692 1 11.139 1 9.5C1 7.86 1.425 7.309 2.275 6.204C3.972 4 6.818 1.5 11 1.5C15.182 1.5 18.028 4 19.725 6.204C20.575 7.31 21 7.861 21 9.5C21 11.14 20.575 11.691 19.725 12.796C18.028 15 15.182 17.5 11 17.5C6.818 17.5 3.972 15 2.275 12.796Z" stroke="#B3B3B3" strokeWidth="1.5" />
              <path d="M14 9.5C14 10.2956 13.6839 11.0587 13.1213 11.6213C12.5587 12.1839 11.7956 12.5 11 12.5C10.2044 12.5 9.44129 12.1839 8.87868 11.6213C8.31607 11.0587 8 10.2956 8 9.5C8 8.70435 8.31607 7.94129 8.87868 7.37868C9.44129 6.81607 10.2044 6.5 11 6.5C11.7956 6.5 12.5587 6.81607 13.1213 7.37868C13.6839 7.94129 14 8.70435 14 9.5Z" stroke="#B3B3B3" strokeWidth="1.5" />
            </svg>
            <span className='text-[#B3B3B3]'>{blog.view}</span>
          </div>
        </div>

        <div>
          <h2 className='heading-2 capitalize text-black mb-[25px] sm:mb-10'>{blog.title} page</h2>
          <img src={blog.img} alt={blog.title} />

          <p className='mt-[25px] sm:mt-10 content text-black'>В последние годы современные жилые комплексы становятся не просто местом для проживания, а настоящими центрами удобства и комфорта. Архитекторы и девелоперы все больше внимания уделяют созданию условий, которые способствуют улучшению качества жизни и удовлетворению потребностей жителей.</p>
        </div>
      </div>

      <section className='bg-blue pb-10 md:pt-10 my-[120px] sm:my-[150px] md:my-[180px]'>
        <div className='container max-w-[1480px] md:flex'>
          <div className='-translate-y-[50px] sm:-translate-y-10 max-w-[281px] sm:max-w-[542px] md:max-w-[710px] md:-translate-y-20 md:absolute'>
            <img src={blog.img} alt={blog.title} />
          </div>
          <div className='flex flex-col ml-auto z-20'>
            <h3 className='heading-3 text-black mb-4 md:mb-5'>Поделитесь новостью</h3>
            <div className='flex items-center gap-3 flex-wrap'>
              <BtnBeigie>Копировать ссылку</BtnBeigie>
              <ul className='flex items-center gap-[23px]'>
                <li>
                  <Link>
                    <svg width="27" height="27" viewBox="0 0 27 27" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M19.3333 0.625C23.2223 0.625 26.375 3.77767 26.375 7.66667V19.3333C26.375 23.2223 23.2223 26.375 19.3333 26.375H7.66667C3.77767 26.375 0.625 23.2223 0.625 19.3333L0.625 7.66667C0.625 3.77767 3.77767 0.625 7.66667 0.625L19.3333 0.625ZM19.3333 3.04167L7.66667 3.04167C5.11236 3.04167 3.04167 5.11236 3.04167 7.66667L3.04167 19.3333C3.04167 21.8877 5.11236 23.9583 7.66667 23.9583H19.3333C21.8877 23.9583 23.9583 21.8877 23.9583 19.3333V7.66667C23.9583 5.11236 21.8877 3.04167 19.3333 3.04167ZM13.5 7.91667C16.5835 7.91667 19.0833 10.4164 19.0833 13.5C19.0833 16.5835 16.5835 19.0833 13.5 19.0833C10.4164 19.0833 7.91667 16.5835 7.91667 13.5C7.91667 10.4164 10.4164 7.91667 13.5 7.91667ZM13.5 10.3333C11.7511 10.3333 10.3333 11.7511 10.3333 13.5C10.3333 15.2489 11.7511 16.6667 13.5 16.6667C15.2489 16.6667 16.6667 15.2489 16.6667 13.5C16.6667 11.7511 15.2489 10.3333 13.5 10.3333ZM20.0625 5.72917C20.7299 5.72917 21.2708 6.27016 21.2708 6.9375C21.2708 7.60484 20.7299 8.14583 20.0625 8.14583C19.3951 8.14583 18.8542 7.60484 18.8542 6.9375C18.8542 6.27016 19.3951 5.72917 20.0625 5.72917Z" fill="#333333" stroke="#F7F7F7" strokeWidth="0.5" />
                    </svg>
                  </Link>
                </li>
                <li>
                  <Link>
                    <svg width="30" height="26" viewBox="0 0 30 26" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M2.00108 11.1918L2.00109 11.1918L26.939 0.69158C28.3442 0.099906 29.8507 1.28815 29.6025 2.79254L26.2937 22.8544C26.0016 24.6254 24.0594 25.6345 22.4415 24.7557C20.9588 23.9504 18.7623 22.7126 16.785 21.4206C15.7974 20.7752 14.8451 20.1039 14.0572 19.4559L14.0572 19.4559C13.5417 19.032 13.0423 18.5752 12.6491 18.1048L12.5836 18.0265L12.482 18.0164C11.023 17.8717 9.18743 17.3579 7.48585 16.7969C5.41682 16.1147 3.35186 15.2947 2.00105 14.7347C0.389752 14.0668 0.453767 11.8432 2.00108 11.1918ZM4.60388 12.718L4.03706 12.9566L4.60964 13.1811C5.70741 13.6115 6.97782 14.0847 8.24254 14.5018L8.24256 14.5018C9.8825 15.0424 11.3918 15.4461 12.4857 15.586L12.6074 15.6016L12.6942 15.5148L19.0208 9.18824L18.844 9.01147L19.0208 9.18824C19.4927 8.71635 20.2578 8.71635 20.7296 9.18824L20.9064 9.01147L20.7296 9.18824C21.2015 9.66009 21.2015 10.4252 20.7296 10.8971L14.953 16.6738L14.7717 16.8551L14.9575 17.0318C15.1341 17.1996 15.3447 17.3859 15.5921 17.5894L15.5921 17.5894C16.2854 18.1595 17.1574 18.777 18.1069 19.3976L18.1069 19.3976C19.9843 20.6242 22.0901 21.8138 23.5486 22.6069L23.8575 22.7749L23.9147 22.428L27.003 3.70253L27.0767 3.2557L26.6593 3.43144L4.60388 12.718Z" fill="#333333" stroke="#F7F7F7" strokeWidth="0.5" />
                    </svg>
                  </Link>
                </li>
                <li>
                  <Link>
                    <svg width="31" height="31" viewBox="0 0 31 31" fill="none" xmlns="http://www.w3.org/2000/svg">
                      <path d="M16.7096 27.0782V27.3613L16.9906 27.3263C22.8692 26.5932 27.418 21.5789 27.418 15.5018C27.418 8.9204 22.0827 3.58512 15.5013 3.58512C8.91991 3.58512 3.58464 8.9204 3.58464 15.5018C3.58464 21.5789 8.13342 26.5932 14.012 27.3263L14.293 27.3613V27.0782V18.4185V18.1685H14.043H11.1263C10.459 18.1685 9.91797 17.6275 9.91797 16.9601C9.91797 16.2928 10.459 15.7518 11.1263 15.7518H14.043H14.293V15.5018V12.5851C14.293 10.307 16.1397 8.46012 18.418 8.46012H19.1471C19.8145 8.46012 20.3555 9.00112 20.3555 9.66846C20.3555 10.3358 19.8145 10.8768 19.1471 10.8768H18.418C17.4745 10.8768 16.7096 11.6416 16.7096 12.5851V15.5018V15.7518L16.9596 15.7518H19.8763C20.5437 15.7518 21.0846 16.2928 21.0846 16.9601C21.0846 17.6275 20.5437 18.1685 19.8763 18.1685H16.9596H16.7096V18.4185V27.0782ZM29.8346 15.5018C29.8346 23.4178 23.4173 29.8351 15.5013 29.8351C7.58522 29.8351 1.16797 23.4178 1.16797 15.5018C1.16797 7.58571 7.58522 1.16846 15.5013 1.16846C23.4173 1.16846 29.8346 7.58571 29.8346 15.5018Z" fill="#333333" stroke="#F7F7F7" strokeWidth="0.5" />
                    </svg>
                  </Link>
                </li>
              </ul>
            </div>
          </div>
        </div>
      </section>

      <section className='md:py-[200px]'>
        <BlogSection title={'Другие статьи'}/>
      </section>
    </>
  )
}

export default Blog